# <FONT COLOR = 'DARKBLUE'> <CENTER> UBER DATABASE PROJECT USING PYTHON & SQL

## Importing Libraries

In [1]:
# Importing required liraries for data celaning, manipulation and analysis
import pandas as pd
import numpy as np

In [2]:
# lading the dataset into a variable called df
df = pd.read_csv(r"C:\Users\admin\Downloads\uber_data.csv")

# displaying the first five rows of the dataset
df.head()

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RatecodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,1,2016-03-01 00:00:00,2016-03-01 00:07:55,1,2.50,-73.976746,40.765152,1,N,-74.004265,40.746128,1,9.0,0.5,0.5,2.05,0.00,0.3,12.35
1,1,2016-03-01 00:00:00,2016-03-01 00:11:06,1,2.90,-73.983482,40.767925,1,N,-74.005943,40.733166,1,11.0,0.5,0.5,3.05,0.00,0.3,15.35
2,2,2016-03-01 00:00:00,2016-03-01 00:31:06,2,19.98,-73.782021,40.644810,1,N,-73.974541,40.675770,1,54.5,0.5,0.5,8.00,0.00,0.3,63.80
3,2,2016-03-01 00:00:00,2016-03-01 00:00:00,3,10.78,-73.863419,40.769814,1,N,-73.969650,40.757767,1,31.5,0.0,0.5,3.78,5.54,0.3,41.62
4,2,2016-03-01 00:00:00,2016-03-01 00:00:00,5,30.43,-73.971741,40.792183,3,N,-74.177170,40.695053,1,98.0,0.0,0.0,0.00,15.50,0.3,113.80

In [3]:
# investigating the shape of the data
df.shape

(100000, 19)

In [4]:
# checking the preliminary information of the data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 19 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   VendorID               100000 non-null  int64
 1   tpep_pickup_datetime   100000 non-null  object
 2   tpep_dropoff_datetime  100000 non-null  object
 3   passenger_count        100000 non-null  int64
 4   trip_distance          100000 non-null  float64
 5   pickup_longitude       100000 non-null  float64
 6   pickup_latitude        100000 non-null  float64
 7   RatecodeID             100000 non-null  int64
 8   store_and_fwd_flag     100000 non-null  object
 9   dropoff_longitude      100000 non-null  float64
 10  dropoff_latitude       100000 non-null  float64
 11  payment_type           100000 non-null  int64
 12  fare_amount            100000 non-null  float64
 13  extra                  100000 non-null  float64
 14  mta_tax                100000 non-null  float64
 15  tip_amount             100000 non-null  float64
 16  tolls_amount           100000 non-null  float64
 17  improvement_surcharge  100000 non-null  float64
 18  total_amount           100000 non-null  float64
dtypes: float64(12), int64(4), object(3)
memory usage: 14.5+ MB

## Data cleaning

In [5]:
# type conversion from object data type to date time format 
df['tpep_pickup_datetime'] = pd.to_datetime(df['tpep_pickup_datetime'])
df['tpep_dropoff_datetime'] = pd.to_datetime(df['tpep_dropoff_datetime'])

In [6]:
# dropping the duplicates
df = df.drop_duplicates().reset_index(drop=True)
df['trip_id'] = df.index

In [7]:
# post dropping the duplicates displaying first five rows
df.head()

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RatecodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount,trip_id
0,1,2016-03-01,2016-03-01 00:07:55,1,2.50,-73.976746,40.765152,1,N,-74.004265,40.746128,1,9.0,0.5,0.5,2.05,0.00,0.3,12.35,0
1,1,2016-03-01,2016-03-01 00:11:06,1,2.90,-73.983482,40.767925,1,N,-74.005943,40.733166,1,11.0,0.5,0.5,3.05,0.00,0.3,15.35,1
2,2,2016-03-01,2016-03-01 00:31:06,2,19.98,-73.782021,40.644810,1,N,-73.974541,40.675770,1,54.5,0.5,0.5,8.00,0.00,0.3,63.80,2
3,2,2016-03-01,2016-03-01 00:00:00,3,10.78,-73.863419,40.769814,1,N,-73.969650,40.757767,1,31.5,0.0,0.5,3.78,5.54,0.3,41.62,3
4,2,2016-03-01,2016-03-01 00:00:00,5,30.43,-73.971741,40.792183,3,N,-74.177170,40.695053,1,98.0,0.0,0.0,0.00,15.50,0.3,113.80,4

### Creating date time dim table

In [8]:
# creating a date time dim table with columns
datetime_dim = df[['tpep_pickup_datetime','tpep_dropoff_datetime']].reset_index(drop=True)
datetime_dim['tpep_pickup_datetime'] = datetime_dim['tpep_pickup_datetime']
datetime_dim['pick_hour'] = datetime_dim['tpep_pickup_datetime'].dt.hour
datetime_dim['pick_day'] = datetime_dim['tpep_pickup_datetime'].dt.day
datetime_dim['pick_month'] = datetime_dim['tpep_pickup_datetime'].dt.month
datetime_dim['pick_year'] = datetime_dim['tpep_pickup_datetime'].dt.year
datetime_dim['pick_weekday'] = datetime_dim['tpep_pickup_datetime'].dt.weekday

# drop off columns
datetime_dim['tpep_dropoff_datetime'] = datetime_dim['tpep_dropoff_datetime']
datetime_dim['drop_hour'] = datetime_dim['tpep_dropoff_datetime'].dt.hour
datetime_dim['drop_day'] = datetime_dim['tpep_dropoff_datetime'].dt.day
datetime_dim['drop_month'] = datetime_dim['tpep_dropoff_datetime'].dt.month
datetime_dim['drop_year'] = datetime_dim['tpep_dropoff_datetime'].dt.year
datetime_dim['drop_weekday'] = datetime_dim['tpep_dropoff_datetime'].dt.weekday


datetime_dim['datetime_id'] = datetime_dim.index

# datetime_dim = datetime_dim.rename(columns={'tpep_pickup_datetime': 'datetime_id'}).reset_index(drop=True)
datetime_dim = datetime_dim[['datetime_id', 'tpep_pickup_datetime', 'pick_hour', 'pick_day', 'pick_month', 'pick_year', 'pick_weekday',
                             'tpep_dropoff_datetime', 'drop_hour', 'drop_day', 'drop_month', 'drop_year', 'drop_weekday']]
# displaying five rows
datetime_dim.head()

,datetime_id,tpep_pickup_datetime,pick_hour,pick_day,pick_month,pick_year,pick_weekday,tpep_dropoff_datetime,drop_hour,drop_day,drop_month,drop_year,drop_weekday
0,0,2016-03-01,0,1,3,2016,1,2016-03-01 00:07:55,0,1,3,2016,1
1,1,2016-03-01,0,1,3,2016,1,2016-03-01 00:11:06,0,1,3,2016,1
2,2,2016-03-01,0,1,3,2016,1,2016-03-01 00:31:06,0,1,3,2016,1
3,3,2016-03-01,0,1,3,2016,1,2016-03-01 00:00:00,0,1,3,2016,1
4,4,2016-03-01,0,1,3,2016,1,2016-03-01 00:00:00,0,1,3,2016,1

### creating passenger count and trip distance table

In [9]:
# passenger count dim columns
passenger_count_dim = df[['passenger_count']].reset_index(drop=True)
passenger_count_dim['passenger_count_id'] = passenger_count_dim.index
passenger_count_dim = passenger_count_dim[['passenger_count_id','passenger_count']]

# trip distance columns
trip_distance_dim = df[['trip_distance']].reset_index(drop=True)
trip_distance_dim['trip_distance_id'] = trip_distance_dim.index
trip_distance_dim = trip_distance_dim[['trip_distance_id','trip_distance']]

### Rate code Types Table

In [12]:
# manually creating a popular stops , with dictionary
ratecode_type = {
    1:"Standard rate",
    2:"JFK",
    3:"Newark",
    4:"Nassau or Westchester",
    5:"Negotiated fare",
    6:"Group ride"
}
# columns
ratecode_dim = df[['RatecodeID']].reset_index(drop=True)
ratecode_dim['rate_code_id'] = ratecode_dim.index
ratecode_dim['rate_code_name'] = ratecode_dim['RatecodeID'].map(ratecode_type)
ratecode_dim = ratecode_dim[['rate_code_id','RatecodeID','rate_code_name']]

In [13]:
# dislaying the first five rows
ratecode_dim.head()

   rate_code_id  RatecodeID rate_code_name
0             0           1  Standard rate
1             1           1  Standard rate
2             2           1  Standard rate
3             3           1  Standard rate
4             4           3         Newark

### Creating pickup location and dropoff location table

In [14]:
# creating the pickup location with particular columns
pickup_location_dim = df[['pickup_longitude', 'pickup_latitude']].reset_index(drop=True)
pickup_location_dim['pickup_location_id'] = pickup_location_dim.index
pickup_location_dim = pickup_location_dim[['pickup_location_id','pickup_latitude','pickup_longitude']] 


dropoff_location_dim = df[['dropoff_longitude', 'dropoff_latitude']].reset_index(drop=True)
dropoff_location_dim['dropoff_location_id'] = dropoff_location_dim.index
dropoff_location_dim = dropoff_location_dim[['dropoff_location_id','dropoff_latitude','dropoff_longitude']]

### Creating payment type table

In [15]:
# manually creating the payment types in dictionary
payment_type_name = {
    1:"Credit card",
    2:"Cash",
    3:"No charge",
    4:"Dispute",
    5:"Unknown",
    6:"Voided trip"
}

# creating payment type and its columns
payment_type_dim = df[['payment_type']].reset_index(drop=True)
payment_type_dim['payment_type_id'] = payment_type_dim.index
payment_type_dim['payment_type_name'] = payment_type_dim['payment_type'].map(payment_type_name)
payment_type_dim = payment_type_dim[['payment_type_id','payment_type','payment_type_name']]

### Creating Fact table

In [17]:
# creating the fact table with required columns
fact_table = df.merge(passenger_count_dim, left_on='trip_id', right_on='passenger_count_id') \
             .merge(trip_distance_dim, left_on='trip_id', right_on='trip_distance_id') \
             .merge(ratecode_dim, left_on='trip_id', right_on='rate_code_id') \
             .merge(pickup_location_dim, left_on='trip_id', right_on='pickup_location_id') \
             .merge(dropoff_location_dim, left_on='trip_id', right_on='dropoff_location_id')\
             .merge(datetime_dim, left_on='trip_id', right_on='datetime_id') \
             .merge(payment_type_dim, left_on='trip_id', right_on='payment_type_id') \
             [['trip_id','VendorID', 'datetime_id', 'passenger_count_id',
               'trip_distance_id', 'rate_code_id', 'store_and_fwd_flag', 'pickup_location_id', 'dropoff_location_id',
               'payment_type_id', 'fare_amount', 'extra', 'mta_tax', 'tip_amount', 'tolls_amount',
               'improvement_surcharge', 'total_amount']]

In [18]:
payment_type_dim.columns

Index(['payment_type_id', 'payment_type', 'payment_type_name'], dtype='object')

In [19]:
fact_table.columns

Index(['trip_id', 'VendorID', 'datetime_id', 'passenger_count_id',
       'trip_distance_id', 'rate_code_id', 'store_and_fwd_flag',
       'pickup_location_id', 'dropoff_location_id', 'payment_type_id',
       'fare_amount', 'extra', 'mta_tax', 'tip_amount', 'tolls_amount',
       'improvement_surcharge', 'total_amount'],
      dtype='object')

### Checking the shapes of each tables

In [22]:
# printing all the table shapes
print("1. Fact table", fact_table.shape) 
print("2. datetime_dim", datetime_dim.shape) 
print("3. Rate code", ratecode_dim.shape) 
print("4. Pickup Location", pickup_location_dim.shape)  
print("5. Drop Location", dropoff_location_dim.shape) 
print("6. Passenger count", passenger_count_dim.shape)
print("7. Trip Distance", trip_distance_dim.shape)
print("8 Payment type:", payment_type_dim.shape)

1. Fact table (100000, 17)
2. datetime_dim (100000, 13)
3. Rate code (100000, 3)
4. Pickup Location (100000, 3)
5. Drop Location (100000, 3)
6. Passenger count (100000, 2)
7. Trip Distance (100000, 2)
8 Payment type: (100000, 3)

## Loading the Data into SQL

### 1. pickup location table

In [37]:
import pandas as pd
import sqlalchemy as sal

# Database connection parameters
username = 'root'
password = 'Akshay123'
database_name = 'uber'
host = '127.0.0.1'
port = '3306'

# MySQL connection string
connection_string = f'mysql+mysqlconnector://{username}:{password}@{host}:{port}/{database_name}'

# Create the SQLAlchemy engine
engine = sal.create_engine(connection_string)

# Check the connection
try:
    with engine.connect() as connection:
        print("Connection successful!")
except Exception as e:
    print(f"Connection error: {e}")

Connection successful!

In [44]:
# renaming the column names as per Database table columns
pickup_location_dim.rename(columns={'pickup_location_id':'pickup_location_id',
                                   'pickup_lattitude':'pickup_lattittude',
                                   'pickup_longitude':'pickup_longitude'},inplace=True)

In [45]:
# Ensure column names match the MySQL table schema
#pickup_location_dim.columns = ['pickup_location_id', 'pickup_lattitude', 'pickup_longitude']

# Write the DataFrame to the MySQL table
try:
    pickup_location_dim.to_sql('pickup_location_dim', con=engine, index=False, if_exists='append')
    print("Data successfully uploaded!")
except Exception as e:
    print(f"Data upload error: {e}")

Data successfully uploaded!

### 2. Trip Distance ID

In [46]:
# verifying the dataset
trip_distance_dim

       trip_distance_id  trip_distance
0                     0           2.50
1                     1           2.90
2                     2          19.98
3                     3          10.78
4                     4          30.43
...                 ...            ...
99995             99995           0.50
99996             99996           3.40
99997             99997           9.70
99998             99998           0.92
99999             99999           1.00

[100000 rows x 2 columns]

In [47]:
# loading into SQL 
try:
    trip_distance_dim.to_sql('trip_distance_dim', con=engine, index=False, if_exists='append')
    print("Data successfully uploaded")
except Exception as e:
    print(f"Data upload error {e}")

Data successfully uploaded

### 3. Data tim dim

In [51]:
# # renaming the column names as per Database table columns
datetime_dim.columns = ['datetime_id', 'tpep_pickup_datetime', 'pickup_hour', 'pickup_day', 'pickup_month',
           'pickup_year', 'pickup_weekday', 'tpep_dropoff_datetime', 'drop_hour', 'drop_day', 
           'drop_month', 'drop_year', 'drop_weekday']

In [52]:
# loading into SQL 
try:
    datetime_dim.to_sql('datetime_dim', con=engine, index=False, if_exists='append')
    print("Data successfully uploaded")
except Exception as e:
    print(f"Data upload error {e}")

Data successfully uploaded

### 4. Passenger Count

In [53]:
# verifying the dataset
passenger_count_dim

       passenger_count_id  passenger_count
0                       0                1
1                       1                1
2                       2                2
3                       3                3
4                       4                5
...                   ...              ...
99995               99995                1
99996               99996                1
99997               99997                1
99998               99998                1
99999               99999                1

[100000 rows x 2 columns]

In [54]:
# loading into SQL 
try:
    passenger_count_dim.to_sql('passenger_count_dim', con=engine, index=False, if_exists='append')
    print("Data successfully uploaded")
except Exception as e:
    print(f"Data upload error {e}")

Data successfully uploaded

### 5. Rate Code DIM

In [55]:
# verifying the dataset
ratecode_dim

       rate_code_id  RatecodeID rate_code_name
0                 0           1  Standard rate
1                 1           1  Standard rate
2                 2           1  Standard rate
3                 3           1  Standard rate
4                 4           3         Newark
...             ...         ...            ...
99995         99995           1  Standard rate
99996         99996           1  Standard rate
99997         99997           1  Standard rate
99998         99998           1  Standard rate
99999         99999           1  Standard rate

[100000 rows x 3 columns]

In [56]:
# loading into SQL 
try:
    ratecode_dim.to_sql('ratecode_dim', con=engine, index=False, if_exists='append')
    print("Data successfully uploaded")
except Exception as e:
    print(f"Data upload error {e}")

Data successfully uploaded

### 6. Dropoff Location

In [58]:
# renaming the column names as per Database table columns

dropoff_location_dim.columns = ['dropoff_location_id',
                                'dropoff_lattittude','dropoff_longitude']

try:
    dropoff_location_dim.to_sql('dropoff_location_dim', con=engine, index=False, if_exists='append')
    print("Data successfully uploaded")
except Exception as e:
    print(f"Data upload error {e}")

Data successfully uploaded

### 7. Payment Type

In [61]:
# loading into SQL 
try:
    payment_type_dim.to_sql('payment_type_dim', con=engine, index=False, if_exists='append')
    print("Data successfully uploaded")
except Exception as e:
    print(f"Data upload error {e}")

Data successfully uploaded

In [63]:
# renaming the column names as per Database table columns
fact_table.columns = ['trip_id', 'vendor_id', 'datetime_id', 'passenger_count_id', 
                      'trip_distance_id', 'rate_code_id', 'store_and_fwd_flag', 
                      'pickup_location', 'dropoff_location', 'payment_type_id', 
                      'fare_amount', 'extra', 'mta_tax', 'tip_amount', 'tolls_amount', 
                      'improvement_surcharge', 'total_amount']

# loading into SQL 
try:
    fact_table.to_sql('fact_table', con=engine, index=False, if_exists='append')
    print("Data successfully uploaded")
except Exception as e:
    print(f"Data upload error {e}")

Data successfully uploaded

# <FONT COLOR = 'DARKBLUE'> <CENTER> CONCLUSION - THANK YOU